import Image from 'next/image';
import styles from './top-slider.module.scss';

function SliderItem() {
  return (
    <article className={styles['slide']}>
      <figure className={styles['slide__cover']}>
        <Image
          src={'/assets/slides/slide1.png'}
          alt={'cover'}
          width={712}
          height={450}
        />
        <div className={styles['overlay']} />
      </figure>
      <div>
        <div className={styles['slide__content-container']}>
          <div className={styles['slide__content']}>
            <header>
              <h3 className={styles['slide__title']}>Темний король</h3>
              <ul className={styles['tags']}>
                <li>
                  <a>Роман</a>,
                </li>
                <li>
                  <a>городское фэнтези</a>,
                </li>
                <li>
                  <a>магия</a>,
                </li>
                <li>
                  <a>приключения</a>
                </li>
              </ul>
            </header>
            <div>
              <p>
                Я – Темний король. Той, хто поєднав демонів. Той, хто володіє
                нескінченною владою та силою. Той, кому це все набридло.
                <br /> Ось уже сотню років. Гидкі гравці атакують наші пекельні
                землі, нещадно грабуючи і вбиваючи мирних демонів.
              </p>
            </div>
            <footer>
              <ul className={styles['stat-list']}>
                <li>
                  <svg
                    width="26"
                    height="25"
                    viewBox="0 0 26 25"
                    fill="currentColor"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M12.0676 1.40576C12.3976 0.554272 13.6024 0.554273 13.9324 1.40576L16.5582 8.1806C16.7001 8.54667 17.043 8.79586 17.435 8.81767L24.6897 9.22139C25.6015 9.27213 25.9738 10.418 25.266 10.9949L19.6341 15.5857C19.3298 15.8338 19.1988 16.237 19.2992 16.6165L21.1571 23.6409C21.3906 24.5237 20.4158 25.2319 19.6484 24.737L13.5419 20.7994C13.212 20.5867 12.788 20.5867 12.4581 20.7994L6.35163 24.737C5.58415 25.2319 4.60945 24.5237 4.84295 23.6409L6.70081 16.6165C6.8012 16.237 6.67019 15.8338 6.36588 15.5857L0.734034 10.9949C0.0262008 10.418 0.398505 9.27213 1.3103 9.22139L8.56496 8.81767C8.95696 8.79585 9.29993 8.54667 9.44181 8.1806L12.0676 1.40576Z"
                      fill="white"
                    />
                  </svg>
                  <span>4,9</span>
                </li>
                <li>
                  <svg
                    width="26"
                    height="16"
                    viewBox="0 0 26 16"
                    fill="currentColor"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M13 0C7.32982 0 2.41511 3.25105 0 8C2.41511 12.749 7.32982 16 13 16C18.67 16 23.5848 12.749 26 8C23.5849 3.25105 18.67 0 13 0ZM19.4099 4.2426C20.9375 5.20195 22.2319 6.48695 23.2042 8C22.2319 9.51305 20.9374 10.7981 19.4099 11.7574C17.4905 12.9629 15.2739 13.6 13 13.6C10.726 13.6 8.50952 12.9629 6.59014 11.7574C5.06264 10.798 3.76822 9.513 2.79591 8C3.76817 6.4869 5.06264 5.2019 6.59014 4.2426C6.68962 4.1801 6.79011 4.11955 6.89122 4.0601C6.63838 4.7433 6.5 5.48065 6.5 6.25C6.5 9.78455 9.41017 12.65 13 12.65C16.5898 12.65 19.5 9.78455 19.5 6.25C19.5 5.48065 19.3616 4.7433 19.1088 4.06005C19.2098 4.1195 19.3104 4.1801 19.4099 4.2426ZM13 5.45C13 6.7755 11.9087 7.85 10.5625 7.85C9.21629 7.85 8.125 6.7755 8.125 5.45C8.125 4.1245 9.21629 3.05 10.5625 3.05C11.9087 3.05 13 4.1245 13 5.45Z"
                      fill="white"
                    />
                  </svg>
                  <span>15,6K</span>
                </li>
                <li>
                  <svg
                    width="14"
                    height="18"
                    viewBox="0 0 14 18"
                    fill="currentColor"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M1.00058 18C0.828791 17.9995 0.660036 17.9547 0.51058 17.87C0.356114 17.7832 0.227492 17.6569 0.13788 17.504C0.0482686 17.3511 0.000885124 17.1772 0.000579768 17V2.33C-0.0129385 1.73032 0.210407 1.14946 0.622213 0.713324C1.03402 0.277184 1.60111 0.0208945 2.20058 0H11.8006C12.4001 0.0208945 12.9671 0.277184 13.3789 0.713324C13.7908 1.14946 14.0141 1.73032 14.0006 2.33V17C13.9995 17.1745 13.9528 17.3457 13.8651 17.4966C13.7774 17.6475 13.6517 17.7727 13.5006 17.86C13.3486 17.9478 13.1761 17.994 13.0006 17.994C12.825 17.994 12.6526 17.9478 12.5006 17.86L6.83058 14.65L1.50058 17.85C1.35013 17.9434 1.17759 17.9951 1.00058 18Z"
                      fill="white"
                    />
                  </svg>
                  <span>15,6K</span>
                </li>
              </ul>
            </footer>
          </div>
        </div>
        <span className={styles['slide__label']}>Комікс</span>
      </div>
    </article>
  );
}

export default SliderItem;
